src/test/resources/store-metadata-request2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:pdm="http://strazzabosco.com/schemas/pdm-ws">
   <soapenv:Header/>
   <soapenv:Body>
      <pdm:storeMetadataRequest>
         <pdm:metadataId>ABC123</pdm:metadataId>
         <pdm:metadataContent>
            <pdm:DatiBO>
                <pdm:Libreria>PRO80DAT</pdm:Libreria>
                <pdm:Documento>OF</pdm:Documento>
                <pdm:NumeroBO>30</pdm:NumeroBO>
                <pdm:DescrizioneBO><![CDATA[CANTIERE PROVA]]></pdm:DescrizioneBO>
                <pdm:TipoDocumento><![CDATA[P]]></pdm:TipoDocumento>
                <pdm:NumeroDocumento>1400053</pdm:NumeroDocumento>
                <pdm:DataDocumento>20141201</pdm:DataDocumento>
                <pdm:DataRichiestaConsegna>20141220</pdm:DataRichiestaConsegna>
                <pdm:DataConfermaConsegna>20141228</pdm:DataConfermaConsegna>
                <pdm:DataIngressoProposta></pdm:DataIngressoProposta>
                <pdm:Riferimento><![CDATA[]]></pdm:Riferimento>
                <pdm:RiferimentoTecnico><![CDATA[]]></pdm:RiferimentoTecnico>
                <pdm:CapoArea><![CDATA[MASENELLO CARLO]]></pdm:CapoArea>
                <pdm:Agente><![CDATA[DIREZIONALI ITALIA]]></pdm:Agente> 
                <pdm:CodiceCliente>1410110000</pdm:CodiceCliente>
                <pdm:RagioneSociale><![CDATA[ALPAC S.R.L. UNIPERSONALE]]></pdm:RagioneSociale>
                <pdm:Firma>S</pdm:Firma>
                <pdm:TipoProdotto><![CDATA[]]></pdm:TipoProdotto>
                <pdm:OrdineIntercompany><![CDATA[]]></pdm:OrdineIntercompany> 
                <pdm:ProvinciaDestinazione><![CDATA[]]></pdm:ProvinciaDestinazione>
                <pdm:DestinatarioMerce><![CDATA[]]></pdm:DestinatarioMerce>
            </pdm:DatiBO>
         </pdm:metadataContent>
      </pdm:storeMetadataRequest>
   </soapenv:Body>
</soapenv:Envelope>
